INSERT INTO categories(category_id, name)
VALUES (1, 'Таблетки'),
       (2, 'Мази'),
       (3, 'Настойки'),
       (4, 'Микстуры'),
       (5, 'Растворы'),
       (6, 'Порошки');

INSERT INTO clients(client_id, first_name, last_name, patronymic, phone, address)
VALUES (1, 'Имя 1', 'Фамилия 1', 'Отчество 1', 'Телефон 1', 'Адрес 1'),
       (2, 'Имя 2', 'Фамилия 2', 'Отчество 2', 'Телефон 2', 'Адрес 2'),
       (3, 'Имя 3', 'Фамилия 3', 'Отчество 3', 'Телефон 3', 'Адрес 3'),
       (4, 'Имя 4', 'Фамилия 4', 'Отчество 4', 'Телефон 4', 'Адрес 4'),
       (5, 'Имя 5', 'Фамилия 5', 'Отчество 5', 'Телефон 5', 'Адрес 5');

INSERT INTO medicines(medicine_id, name, category_id, cost)
VALUES (1, 'Таблетка 1', 1, 100),
       (2, 'Мазь 1', 2, 50.50),
       (3, 'Настойка 1', 3, 15.45),
       (4, 'Микстура 1', 4, 100),
       (5, 'Раствор 1', 5, 70),
       (6, 'Порошок 1', 6, 85.25),
       (7, 'Таблетка 2', 1, 125),
       (8, 'Мазь 2', 2, 150.50),
       (9, 'Настойка 2', 3, 145),
       (10, 'Микстура 2', 4, 135.70),
       (11, 'Раствор 2', 5, 170),
       (12, 'Порошок 2', 6, 165.70);

INSERT INTO recipes(recipe_id, client_id, diagnosis, medicine_id, amount_medicine)
VALUES (1, 1, 'Диагноз 1', 1, 1),
       (2, 4, 'Диагноз 2', 1, 1),
       (3, 1, 'Диагноз 3', 1, 1),
       (4, 1, 'Диагноз 4', 2, 1),
       (5, 1, 'Диагноз 5', 5, 1),
       (6, 1, 'Диагноз 6', 3, 1),
       (7, 2, 'Диагноз 7', 1, 1),
       (8, 2, 'Диагноз 8', 2, 1),
       (9, 2, 'Диагноз 9', 3, 1),
       (10, 3, 'Диагноз 10', 7, 1),
       (11, 5, 'Диагноз 11', 12, 1),
       (12, 5, 'Диагноз 12', 11, 1),
       (13, 5, 'Диагноз 12', 10, 1),
       (14, 4, 'Диагноз 12', 10, 1),
       (15, 3, 'Диагноз 12', 12, 1);

INSERT INTO orders_steps(step_id, name)
VALUES (1, 'Формирование'),
       (2, 'Ожидание'),
       (3, 'Изготовление'),
       (4, 'Готово'),
       (5, 'Выдано');

INSERT INTO orders(order_id, recipe_id, step_id, creation_date, order_time, recipe_date)
VALUES (1, 1, 1, '2023-06-20', '2023-06-22', NULL),
       (2, 2, 2, '2023-06-18', '2023-06-20', NULL),
       (3, 3, 3, '2023-06-20', '2023-06-24', NULL),
       (4, 4, 3, '2023-06-19', '2023-06-21', NULL),
       (5, 5, 5, '2023-06-16', '2023-06-18', '2023-06-18'), -- Забрал (Выдано)
       (6, 6, 4, '2023-06-17', '2023-06-20', NULL),         -- Готово
       (7, 7, 3, '2023-06-19', '2023-06-22', NULL),
       (8, 8, 3, '2023-06-17', '2023-06-21', NULL),
       (9, 9, 2, '2023-06-21', '2023-06-25', NULL),
       (10, 10, 2, '2023-06-16', '2023-06-19', NULL),
       (11, 11, 2, '2023-06-15', '2023-06-17', NULL),
       (12, 12, 2, '2023-06-15', '2023-06-18', NULL),
       (13, 13, 2, '2023-06-16', '2023-06-19', NULL),
       (14, 14, 3, '2023-06-19', '2023-06-21', NULL),
       (15, 15, 4, '2023-06-15', '2023-06-16', NULL); -- Готово

INSERT INTO warehouse(item_id, medicine_id, critical_rate, quantity)
VALUES (1, 1, 100, 110),
       (2, 2, 10, 11),
       (3, 3, 45, 50),
       (4, 4, 45, 45),  -- ОЙ
       (5, 5, 100, 135),
       (6, 6, 95, 0),   -- ОЙ
       (7, 7, 50, 100),
       (8, 8, 100, 90), -- ОЙ
       (9, 9, 50, 90),
       (10, 10, 60, 65),
       (11, 11, 50, 0), -- ОЙ
       (12, 12, 50, 100);

INSERT INTO technologies(technology_id, medicine_id, cooking_method)
VALUES (1, 7, 'Способ 1'),
       (2, 8, 'Способ 2'),
       (3, 9, 'Способ 3'),
       (4, 10, 'Способ 4'),
       (5, 11, 'Способ 5'),
       (6, 12, 'Способ 6');

INSERT INTO components(technologies_id, drug_component)
VALUES (1, 1),
       (1, 5),
       (2, 2),
       (2, 6),
       (3, 3),
       (3, 6),
       (3, 1),
       (4, 4),
       (5, 5),
       (5, 1),
       (6, 6),
       (6, 1);
